app/controllers/applicants_controller.rb

SELECT "applicants".* FROM "applicants"
---
  def index
    @applicants = Applicant.all

INSERT INTO "applicants" ("created_at", "firstname", "lastname", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 16 Nov 2013 08:12:37 UTC +00:00], ["firstname", "marjan"], ["lastname", "zia"], ["updated_at", Sat, 16 Nov 2013 08:12:37 UTC +00:00]]
---
  def create
    @applicant = Applicant.new(applicant_params)

    respond_to do |format|
      if @applicant.save

SELECT "applicants".* FROM "applicants" WHERE "applicants"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_applicant
      @applicant = Applicant.find(params[:id])